<script setup lang="ts">
import { ref } from 'vue';
import Check from '../../icons/Check.vue';

const texts = ref<string[]>([
  'TV с большой диагональю на котором тренер запускает тренажёр для тренировок',
  'Большие тренировочные настенные и напольные абакусы',
  'Диванчик на котором дети могут отдохнуть во время перерыва',
  'Витрина магазина в котором дети могут приобрести призы за монетки Soroboom',
  'Просторные светлые кабинеты с необходимым школьным оборудованием и демонстрационными материалами'
]);
</script>

<template>
  <div v-for="(text, index) in texts">
    <Check :color="index%2==0 ? '#EC6A1F' : '#42BE63'" :size="12" />
    <span>
      {{ text }}
    </span>
  </div>
</template>